docs/validation/r1-20260821-evidence/run-a/runA-k6-console.log
Attestation accepted: perf-standard-01 on ip-172-31-11-69 (8 CPUs, 30.81 GiB), attested 2026-08-21T09:46:52+00:00.
Provisioned 20 load learner(s) 'load-learner-000..019' and enabled direct access grants on ramals-web-ui.
Running k6 scenario 'mixed-learning' (env=perf-standard-01, commit=f7fb9efad94fbbebd68ea24cabdf79a1e2f50cb8, learners=20)

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /home/ubuntu/performance/scenarios/mixed-learning.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 4m0s max duration (incl. graceful stop):
              * mixed_open: Up to 60.00 iterations/s for 3m30s over 3 stages (maxVUs: 50-300, gracefulStop: 30s)


running (0m01.0s), 001/050 VUs, 1 complete and 0 interrupted iterations
mixed_open   [   0% ] 001/050 VUs  0m00.2s/3m30s  10.00 iters/s

running (0m02.0s), 001/050 VUs, 11 complete and 0 interrupted iterations
mixed_open   [   1% ] 001/050 VUs  0m01.2s/3m30s  10.00 iters/s

running (0m03.0s), 001/050 VUs, 21 complete and 0 interrupted iterations
mixed_open   [   1% ] 001/050 VUs  0m02.2s/3m30s  10.00 iters/s

running (0m04.0s), 001/050 VUs, 31 complete and 0 interrupted iterations
mixed_open   [   2% ] 001/050 VUs  0m03.2s/3m30s  10.00 iters/s

running (0m05.0s), 001/050 VUs, 41 complete and 0 interrupted iterations
mixed_open   [   2% ] 001/050 VUs  0m04.2s/3m30s  10.00 iters/s

running (0m06.0s), 001/050 VUs, 51 complete and 0 interrupted iterations
mixed_open   [   2% ] 001/050 VUs  0m05.2s/3m30s  10.00 iters/s

running (0m07.0s), 001/050 VUs, 61 complete and 0 interrupted iterations
mixed_open   [   3% ] 001/050 VUs  0m06.2s/3m30s  10.00 iters/s

running (0m08.0s), 001/050 VUs, 71 complete and 0 interrupted iterations
mixed_open   [   3% ] 001/050 VUs  0m07.2s/3m30s  10.00 iters/s

running (0m09.0s), 001/050 VUs, 81 complete and 0 interrupted iterations
mixed_open   [   4% ] 001/050 VUs  0m08.2s/3m30s  10.00 iters/s

running (0m10.0s), 001/050 VUs, 91 complete and 0 interrupted iterations
mixed_open   [   4% ] 001/050 VUs  0m09.2s/3m30s  10.00 iters/s

running (0m11.0s), 001/050 VUs, 101 complete and 0 interrupted iterations
mixed_open   [   5% ] 001/050 VUs  0m10.2s/3m30s  10.00 iters/s

running (0m12.0s), 001/050 VUs, 111 complete and 0 interrupted iterations
mixed_open   [   5% ] 001/050 VUs  0m11.2s/3m30s  10.00 iters/s

running (0m13.0s), 001/050 VUs, 121 complete and 0 interrupted iterations
mixed_open   [   6% ] 001/050 VUs  0m12.2s/3m30s  10.00 iters/s

running (0m14.0s), 001/050 VUs, 131 complete and 0 interrupted iterations
mixed_open   [   6% ] 001/050 VUs  0m13.2s/3m30s  10.00 iters/s

running (0m15.0s), 001/050 VUs, 141 complete and 0 interrupted iterations
mixed_open   [   7% ] 001/050 VUs  0m14.2s/3m30s  10.00 iters/s

running (0m16.0s), 001/050 VUs, 151 complete and 0 interrupted iterations
mixed_open   [   7% ] 001/050 VUs  0m15.2s/3m30s  10.00 iters/s

running (0m17.0s), 001/050 VUs, 161 complete and 0 interrupted iterations
mixed_open   [   8% ] 001/050 VUs  0m16.2s/3m30s  10.00 iters/s

running (0m18.0s), 001/050 VUs, 171 complete and 0 interrupted iterations
mixed_open   [   8% ] 001/050 VUs  0m17.2s/3m30s  10.00 iters/s

running (0m19.0s), 001/050 VUs, 181 complete and 0 interrupted iterations
mixed_open   [   9% ] 001/050 VUs  0m18.2s/3m30s  10.00 iters/s

running (0m20.0s), 001/050 VUs, 191 complete and 0 interrupted iterations
mixed_open   [   9% ] 001/050 VUs  0m19.2s/3m30s  10.00 iters/s

running (0m21.0s), 001/050 VUs, 201 complete and 0 interrupted iterations
mixed_open   [  10% ] 001/050 VUs  0m20.2s/3m30s  10.00 iters/s

running (0m22.0s), 000/050 VUs, 212 complete and 0 interrupted iterations
mixed_open   [  10% ] 000/050 VUs  0m21.2s/3m30s  10.00 iters/s

running (0m23.0s), 001/050 VUs, 221 complete and 0 interrupted iterations
mixed_open   [  11% ] 001/050 VUs  0m22.2s/3m30s  10.00 iters/s

running (0m24.0s), 001/050 VUs, 231 complete and 0 interrupted iterations
mixed_open   [  11% ] 001/050 VUs  0m23.2s/3m30s  10.00 iters/s

running (0m25.0s), 001/050 VUs, 241 complete and 0 interrupted iterations
mixed_open   [  12% ] 001/050 VUs  0m24.2s/3m30s  10.00 iters/s

running (0m26.0s), 001/050 VUs, 251 complete and 0 interrupted iterations
mixed_open   [  12% ] 001/050 VUs  0m25.2s/3m30s  10.00 iters/s

running (0m27.0s), 001/050 VUs, 261 complete and 0 interrupted iterations
mixed_open   [  12% ] 001/050 VUs  0m26.2s/3m30s  10.00 iters/s

running (0m28.0s), 001/050 VUs, 271 complete and 0 interrupted iterations
mixed_open   [  13% ] 001/050 VUs  0m27.2s/3m30s  10.00 iters/s

running (0m29.0s), 001/050 VUs, 281 complete and 0 interrupted iterations
mixed_open   [  13% ] 001/050 VUs  0m28.2s/3m30s  10.00 iters/s

running (0m30.0s), 001/050 VUs, 291 complete and 0 interrupted iterations
mixed_open   [  14% ] 001/050 VUs  0m29.2s/3m30s  10.00 iters/s

running (0m31.0s), 001/050 VUs, 301 complete and 0 interrupted iterations
mixed_open   [  14% ] 001/050 VUs  0m30.2s/3m30s  10.21 iters/s

running (0m32.0s), 000/050 VUs, 312 complete and 0 interrupted iterations
mixed_open   [  15% ] 000/050 VUs  0m31.2s/3m30s  10.99 iters/s

running (0m33.0s), 001/050 VUs, 323 complete and 0 interrupted iterations
mixed_open   [  15% ] 001/050 VUs  0m32.2s/3m30s  11.87 iters/s

running (0m34.0s), 000/050 VUs, 336 complete and 0 interrupted iterations
mixed_open   [  16% ] 000/050 VUs  0m33.2s/3m30s  12.68 iters/s

running (0m35.0s), 001/050 VUs, 348 complete and 0 interrupted iterations
mixed_open   [  16% ] 001/050 VUs  0m34.2s/3m30s  13.51 iters/s

running (0m36.0s), 000/050 VUs, 363 complete and 0 interrupted iterations
mixed_open   [  17% ] 000/050 VUs  0m35.2s/3m30s  14.35 iters/s

running (0m37.0s), 001/050 VUs, 377 complete and 0 interrupted iterations
mixed_open   [  17% ] 001/050 VUs  0m36.2s/3m30s  15.19 iters/s

running (0m38.0s), 000/050 VUs, 393 complete and 0 interrupted iterations
mixed_open   [  18% ] 000/050 VUs  0m37.2s/3m30s  15.99 iters/s

running (0m39.0s), 001/050 VUs, 409 complete and 0 interrupted iterations
mixed_open   [  18% ] 001/050 VUs  0m38.2s/3m30s  16.86 iters/s

running (0m40.0s), 000/050 VUs, 427 complete and 0 interrupted iterations
mixed_open   [  19% ] 000/050 VUs  0m39.2s/3m30s  17.68 iters/s

running (0m41.0s), 000/050 VUs, 445 complete and 0 interrupted iterations
mixed_open   [  19% ] 000/050 VUs  0m40.2s/3m30s  18.51 iters/s

running (0m42.0s), 000/050 VUs, 464 complete and 0 interrupted iterations
mixed_open   [  20% ] 000/050 VUs  0m41.2s/3m30s  19.34 iters/s

running (0m43.0s), 000/050 VUs, 484 complete and 0 interrupted iterations
mixed_open   [  20% ] 000/050 VUs  0m42.2s/3m30s  20.19 iters/s

running (0m44.0s), 000/050 VUs, 504 complete and 0 interrupted iterations
mixed_open   [  21% ] 000/050 VUs  0m43.2s/3m30s  21.00 iters/s

running (0m45.0s), 001/050 VUs, 525 complete and 0 interrupted iterations
mixed_open   [  21% ] 001/050 VUs  0m44.2s/3m30s  21.85 iters/s

running (0m46.0s), 000/050 VUs, 548 complete and 0 interrupted iterations
mixed_open   [  22% ] 000/050 VUs  0m45.2s/3m30s  22.68 iters/s

running (0m47.0s), 001/050 VUs, 570 complete and 0 interrupted iterations
mixed_open   [  22% ] 001/050 VUs  0m46.2s/3m30s  23.51 iters/s

running (0m48.0s), 000/050 VUs, 595 complete and 0 interrupted iterations
mixed_open   [  22% ] 000/050 VUs  0m47.2s/3m30s  24.34 iters/s

running (0m49.0s), 001/050 VUs, 619 complete and 0 interrupted iterations
mixed_open   [  23% ] 001/050 VUs  0m48.2s/3m30s  25.18 iters/s

running (0m50.0s), 000/050 VUs, 645 complete and 0 interrupted iterations
mixed_open   [  23% ] 000/050 VUs  0m49.2s/3m30s  26.00 iters/s

running (0m51.0s), 000/050 VUs, 672 complete and 0 interrupted iterations
mixed_open   [  24% ] 000/050 VUs  0m50.2s/3m30s  26.85 iters/s

running (0m52.0s), 000/050 VUs, 699 complete and 0 interrupted iterations
mixed_open   [  24% ] 000/050 VUs  0m51.2s/3m30s  27.67 iters/s

running (0m53.0s), 000/050 VUs, 727 complete and 0 interrupted iterations
mixed_open   [  25% ] 000/050 VUs  0m52.2s/3m30s  28.50 iters/s

running (0m54.0s), 000/050 VUs, 756 complete and 0 interrupted iterations
mixed_open   [  25% ] 000/050 VUs  0m53.2s/3m30s  29.34 iters/s

running (0m55.0s), 000/050 VUs, 786 complete and 0 interrupted iterations
mixed_open   [  26% ] 000/050 VUs  0m54.2s/3m30s  30.18 iters/s

running (0m56.0s), 000/050 VUs, 816 complete and 0 interrupted iterations
mixed_open   [  26% ] 000/050 VUs  0m55.2s/3m30s  31.00 iters/s

running (0m57.0s), 001/050 VUs, 847 complete and 0 interrupted iterations
mixed_open   [  27% ] 001/050 VUs  0m56.2s/3m30s  31.85 iters/s

running (0m58.0s), 000/050 VUs, 880 complete and 0 interrupted iterations
mixed_open   [  27% ] 000/050 VUs  0m57.2s/3m30s  32.67 iters/s

running (0m59.0s), 000/050 VUs, 913 complete and 0 interrupted iterations
mixed_open   [  28% ] 000/050 VUs  0m58.2s/3m30s  33.50 iters/s

running (1m00.0s), 000/050 VUs, 947 complete and 0 interrupted iterations
mixed_open   [  28% ] 000/050 VUs  0m59.2s/3m30s  34.34 iters/s

running (1m01.0s), 000/050 VUs, 982 complete and 0 interrupted iterations
mixed_open   [  29% ] 000/050 VUs  1m00.2s/3m30s  35.18 iters/s

running (1m02.0s), 000/050 VUs, 1017 complete and 0 interrupted iterations
mixed_open   [  29% ] 000/050 VUs  1m01.2s/3m30s  36.00 iters/s

running (1m03.0s), 000/050 VUs, 1054 complete and 0 interrupted iterations
mixed_open   [  30% ] 000/050 VUs  1m02.2s/3m30s  36.84 iters/s

running (1m04.0s), 000/050 VUs, 1091 complete and 0 interrupted iterations
mixed_open   [  30% ] 000/050 VUs  1m03.2s/3m30s  37.67 iters/s

running (1m05.0s), 000/050 VUs, 1129 complete and 0 interrupted iterations
mixed_open   [  31% ] 000/050 VUs  1m04.2s/3m30s  38.50 iters/s

running (1m06.0s), 000/050 VUs, 1168 complete and 0 interrupted iterations
mixed_open   [  31% ] 000/050 VUs  1m05.2s/3m30s  39.34 iters/s

running (1m07.0s), 001/050 VUs, 1207 complete and 0 interrupted iterations
mixed_open   [  32% ] 001/050 VUs  1m06.2s/3m30s  40.18 iters/s

running (1m08.0s), 001/050 VUs, 1247 complete and 0 interrupted iterations
mixed_open   [  32% ] 001/050 VUs  1m07.2s/3m30s  41.00 iters/s

running (1m09.0s), 000/050 VUs, 1290 complete and 0 interrupted iterations
mixed_open   [  32% ] 000/050 VUs  1m08.2s/3m30s  41.84 iters/s

running (1m10.0s), 000/050 VUs, 1332 complete and 0 interrupted iterations
mixed_open   [  33% ] 000/050 VUs  1m09.2s/3m30s  42.67 iters/s

running (1m11.0s), 000/050 VUs, 1375 complete and 0 interrupted iterations
mixed_open   [  33% ] 000/050 VUs  1m10.2s/3m30s  43.50 iters/s

running (1m12.0s), 001/050 VUs, 1418 complete and 0 interrupted iterations
mixed_open   [  34% ] 001/050 VUs  1m11.2s/3m30s  44.34 iters/s

running (1m13.0s), 000/050 VUs, 1464 complete and 0 interrupted iterations
mixed_open   [  34% ] 000/050 VUs  1m12.2s/3m30s  45.18 iters/s

running (1m14.0s), 000/050 VUs, 1509 complete and 0 interrupted iterations
mixed_open   [  35% ] 000/050 VUs  1m13.2s/3m30s  46.00 iters/s

running (1m15.0s), 000/050 VUs, 1556 complete and 0 interrupted iterations
mixed_open   [  35% ] 000/050 VUs  1m14.2s/3m30s  46.84 iters/s

running (1m16.0s), 000/050 VUs, 1603 complete and 0 interrupted iterations
mixed_open   [  36% ] 000/050 VUs  1m15.2s/3m30s  47.67 iters/s

running (1m17.0s), 000/050 VUs, 1651 complete and 0 interrupted iterations
mixed_open   [  36% ] 000/050 VUs  1m16.2s/3m30s  48.50 iters/s

running (1m18.0s), 000/050 VUs, 1700 complete and 0 interrupted iterations
mixed_open   [  37% ] 000/050 VUs  1m17.2s/3m30s  49.34 iters/s

running (1m19.0s), 000/050 VUs, 1750 complete and 0 interrupted iterations
mixed_open   [  37% ] 000/050 VUs  1m18.2s/3m30s  50.17 iters/s

running (1m20.0s), 000/050 VUs, 1800 complete and 0 interrupted iterations
mixed_open   [  38% ] 000/050 VUs  1m19.2s/3m30s  51.00 iters/s

running (1m21.0s), 001/050 VUs, 1851 complete and 0 interrupted iterations
mixed_open   [  38% ] 001/050 VUs  1m20.2s/3m30s  51.84 iters/s

running (1m22.0s), 000/050 VUs, 1904 complete and 0 interrupted iterations
mixed_open   [  39% ] 000/050 VUs  1m21.2s/3m30s  52.67 iters/s

running (1m23.0s), 000/050 VUs, 1957 complete and 0 interrupted iterations
mixed_open   [  39% ] 000/050 VUs  1m22.2s/3m30s  53.50 iters/s

running (1m24.0s), 000/050 VUs, 2011 complete and 0 interrupted iterations
mixed_open   [  40% ] 000/050 VUs  1m23.2s/3m30s  54.34 iters/s

running (1m25.0s), 001/050 VUs, 2065 complete and 0 interrupted iterations
mixed_open   [  40% ] 001/050 VUs  1m24.2s/3m30s  55.17 iters/s

running (1m26.0s), 000/050 VUs, 2121 complete and 0 interrupted iterations
mixed_open   [  41% ] 000/050 VUs  1m25.2s/3m30s  56.00 iters/s

running (1m27.0s), 000/050 VUs, 2178 complete and 0 interrupted iterations
mixed_open   [  41% ] 000/050 VUs  1m26.2s/3m30s  56.84 iters/s

running (1m28.0s), 001/050 VUs, 2234 complete and 0 interrupted iterations
mixed_open   [  42% ] 001/050 VUs  1m27.2s/3m30s  57.67 iters/s

running (1m29.0s), 000/050 VUs, 2293 complete and 0 interrupted iterations
mixed_open   [  42% ] 000/050 VUs  1m28.2s/3m30s  58.50 iters/s

running (1m30.0s), 000/050 VUs, 2352 complete and 0 interrupted iterations
mixed_open   [  42% ] 000/050 VUs  1m29.2s/3m30s  59.34 iters/s

running (1m31.0s), 001/050 VUs, 2411 complete and 0 interrupted iterations
mixed_open   [  43% ] 001/050 VUs  1m30.2s/3m30s  60.00 iters/s

running (1m32.0s), 000/050 VUs, 2472 complete and 0 interrupted iterations
mixed_open   [  43% ] 000/050 VUs  1m31.2s/3m30s  60.00 iters/s

running (1m33.0s), 000/050 VUs, 2532 complete and 0 interrupted iterations
mixed_open   [  44% ] 000/050 VUs  1m32.2s/3m30s  60.00 iters/s

running (1m34.0s), 000/050 VUs, 2592 complete and 0 interrupted iterations
mixed_open   [  44% ] 000/050 VUs  1m33.2s/3m30s  60.00 iters/s

running (1m35.0s), 000/050 VUs, 2652 complete and 0 interrupted iterations
mixed_open   [  45% ] 000/050 VUs  1m34.2s/3m30s  60.00 iters/s

running (1m36.0s), 000/050 VUs, 2712 complete and 0 interrupted iterations
mixed_open   [  45% ] 000/050 VUs  1m35.2s/3m30s  60.00 iters/s

running (1m37.0s), 000/050 VUs, 2772 complete and 0 interrupted iterations
mixed_open   [  46% ] 000/050 VUs  1m36.2s/3m30s  60.00 iters/s

running (1m38.0s), 000/050 VUs, 2832 complete and 0 interrupted iterations
mixed_open   [  46% ] 000/050 VUs  1m37.2s/3m30s  60.00 iters/s

running (1m39.0s), 000/050 VUs, 2892 complete and 0 interrupted iterations
mixed_open   [  47% ] 000/050 VUs  1m38.2s/3m30s  60.00 iters/s

running (1m40.0s), 000/050 VUs, 2952 complete and 0 interrupted iterations
mixed_open   [  47% ] 000/050 VUs  1m39.2s/3m30s  60.00 iters/s

running (1m41.0s), 000/050 VUs, 3012 complete and 0 interrupted iterations
mixed_open   [  48% ] 000/050 VUs  1m40.2s/3m30s  60.00 iters/s

running (1m42.0s), 000/050 VUs, 3072 complete and 0 interrupted iterations
mixed_open   [  48% ] 000/050 VUs  1m41.2s/3m30s  60.00 iters/s

running (1m43.0s), 001/050 VUs, 3131 complete and 0 interrupted iterations
mixed_open   [  49% ] 001/050 VUs  1m42.2s/3m30s  60.00 iters/s

running (1m44.0s), 000/050 VUs, 3192 complete and 0 interrupted iterations
mixed_open   [  49% ] 000/050 VUs  1m43.2s/3m30s  60.00 iters/s

running (1m45.0s), 000/050 VUs, 3252 complete and 0 interrupted iterations
mixed_open   [  50% ] 000/050 VUs  1m44.2s/3m30s  60.00 iters/s

running (1m46.0s), 000/050 VUs, 3312 complete and 0 interrupted iterations
mixed_open   [  50% ] 000/050 VUs  1m45.2s/3m30s  60.00 iters/s

running (1m47.0s), 000/050 VUs, 3372 complete and 0 interrupted iterations
mixed_open   [  51% ] 000/050 VUs  1m46.2s/3m30s  60.00 iters/s

running (1m48.0s), 000/050 VUs, 3432 complete and 0 interrupted iterations
mixed_open   [  51% ] 000/050 VUs  1m47.2s/3m30s  60.00 iters/s

running (1m49.0s), 000/050 VUs, 3492 complete and 0 interrupted iterations
mixed_open   [  52% ] 000/050 VUs  1m48.2s/3m30s  60.00 iters/s

running (1m50.0s), 000/050 VUs, 3552 complete and 0 interrupted iterations
mixed_open   [  52% ] 000/050 VUs  1m49.2s/3m30s  60.00 iters/s

running (1m51.0s), 000/050 VUs, 3612 complete and 0 interrupted iterations
mixed_open   [  52% ] 000/050 VUs  1m50.2s/3m30s  60.00 iters/s

running (1m52.0s), 000/050 VUs, 3672 complete and 0 interrupted iterations
mixed_open   [  53% ] 000/050 VUs  1m51.2s/3m30s  60.00 iters/s

running (1m53.0s), 000/050 VUs, 3732 complete and 0 interrupted iterations
mixed_open   [  53% ] 000/050 VUs  1m52.2s/3m30s  60.00 iters/s

running (1m54.0s), 000/050 VUs, 3792 complete and 0 interrupted iterations
mixed_open   [  54% ] 000/050 VUs  1m53.2s/3m30s  60.00 iters/s

running (1m55.0s), 000/050 VUs, 3852 complete and 0 interrupted iterations
mixed_open   [  54% ] 000/050 VUs  1m54.2s/3m30s  60.00 iters/s

running (1m56.0s), 000/050 VUs, 3912 complete and 0 interrupted iterations
mixed_open   [  55% ] 000/050 VUs  1m55.2s/3m30s  60.00 iters/s

running (1m57.0s), 000/050 VUs, 3972 complete and 0 interrupted iterations
mixed_open   [  55% ] 000/050 VUs  1m56.2s/3m30s  60.00 iters/s

running (1m58.0s), 000/050 VUs, 4032 complete and 0 interrupted iterations
mixed_open   [  56% ] 000/050 VUs  1m57.2s/3m30s  60.00 iters/s

running (1m59.0s), 000/050 VUs, 4092 complete and 0 interrupted iterations
mixed_open   [  56% ] 000/050 VUs  1m58.2s/3m30s  60.00 iters/s

running (2m00.0s), 000/050 VUs, 4152 complete and 0 interrupted iterations
mixed_open   [  57% ] 000/050 VUs  1m59.2s/3m30s  60.00 iters/s

running (2m01.0s), 000/050 VUs, 4212 complete and 0 interrupted iterations
mixed_open   [  57% ] 000/050 VUs  2m00.2s/3m30s  60.00 iters/s

running (2m02.0s), 000/050 VUs, 4272 complete and 0 interrupted iterations
mixed_open   [  58% ] 000/050 VUs  2m01.2s/3m30s  60.00 iters/s

running (2m03.0s), 000/050 VUs, 4332 complete and 0 interrupted iterations
mixed_open   [  58% ] 000/050 VUs  2m02.2s/3m30s  60.00 iters/s

running (2m04.0s), 000/050 VUs, 4392 complete and 0 interrupted iterations
mixed_open   [  59% ] 000/050 VUs  2m03.2s/3m30s  60.00 iters/s

running (2m05.0s), 000/050 VUs, 4452 complete and 0 interrupted iterations
mixed_open   [  59% ] 000/050 VUs  2m04.2s/3m30s  60.00 iters/s

running (2m06.0s), 000/050 VUs, 4512 complete and 0 interrupted iterations
mixed_open   [  60% ] 000/050 VUs  2m05.2s/3m30s  60.00 iters/s

running (2m07.0s), 000/050 VUs, 4572 complete and 0 interrupted iterations
mixed_open   [  60% ] 000/050 VUs  2m06.2s/3m30s  60.00 iters/s

running (2m08.0s), 001/050 VUs, 4631 complete and 0 interrupted iterations
mixed_open   [  61% ] 001/050 VUs  2m07.2s/3m30s  60.00 iters/s

running (2m09.0s), 000/050 VUs, 4692 complete and 0 interrupted iterations
mixed_open   [  61% ] 000/050 VUs  2m08.2s/3m30s  60.00 iters/s

running (2m10.0s), 000/050 VUs, 4752 complete and 0 interrupted iterations
mixed_open   [  62% ] 000/050 VUs  2m09.2s/3m30s  60.00 iters/s

running (2m11.0s), 000/050 VUs, 4812 complete and 0 interrupted iterations
mixed_open   [  62% ] 000/050 VUs  2m10.2s/3m30s  60.00 iters/s

running (2m12.0s), 000/050 VUs, 4872 complete and 0 interrupted iterations
mixed_open   [  62% ] 000/050 VUs  2m11.2s/3m30s  60.00 iters/s

running (2m13.0s), 000/050 VUs, 4932 complete and 0 interrupted iterations
mixed_open   [  63% ] 000/050 VUs  2m12.2s/3m30s  60.00 iters/s

running (2m14.0s), 000/050 VUs, 4992 complete and 0 interrupted iterations
mixed_open   [  63% ] 000/050 VUs  2m13.2s/3m30s  60.00 iters/s

running (2m15.0s), 000/050 VUs, 5052 complete and 0 interrupted iterations
mixed_open   [  64% ] 000/050 VUs  2m14.2s/3m30s  60.00 iters/s

running (2m16.0s), 000/050 VUs, 5112 complete and 0 interrupted iterations
mixed_open   [  64% ] 000/050 VUs  2m15.2s/3m30s  60.00 iters/s

running (2m17.0s), 000/050 VUs, 5172 complete and 0 interrupted iterations
mixed_open   [  65% ] 000/050 VUs  2m16.2s/3m30s  60.00 iters/s

running (2m18.0s), 000/050 VUs, 5232 complete and 0 interrupted iterations
mixed_open   [  65% ] 000/050 VUs  2m17.2s/3m30s  60.00 iters/s

running (2m19.0s), 000/050 VUs, 5292 complete and 0 interrupted iterations
mixed_open   [  66% ] 000/050 VUs  2m18.2s/3m30s  60.00 iters/s

running (2m20.0s), 000/050 VUs, 5352 complete and 0 interrupted iterations
mixed_open   [  66% ] 000/050 VUs  2m19.2s/3m30s  60.00 iters/s

running (2m21.0s), 000/050 VUs, 5412 complete and 0 interrupted iterations
mixed_open   [  67% ] 000/050 VUs  2m20.2s/3m30s  60.00 iters/s

running (2m22.0s), 000/050 VUs, 5472 complete and 0 interrupted iterations
mixed_open   [  67% ] 000/050 VUs  2m21.2s/3m30s  60.00 iters/s

running (2m23.0s), 000/050 VUs, 5532 complete and 0 interrupted iterations
mixed_open   [  68% ] 000/050 VUs  2m22.2s/3m30s  60.00 iters/s

running (2m24.0s), 000/050 VUs, 5592 complete and 0 interrupted iterations
mixed_open   [  68% ] 000/050 VUs  2m23.2s/3m30s  60.00 iters/s

running (2m25.0s), 000/050 VUs, 5652 complete and 0 interrupted iterations
mixed_open   [  69% ] 000/050 VUs  2m24.2s/3m30s  60.00 iters/s

running (2m26.0s), 000/050 VUs, 5712 complete and 0 interrupted iterations
mixed_open   [  69% ] 000/050 VUs  2m25.2s/3m30s  60.00 iters/s

running (2m27.0s), 000/050 VUs, 5772 complete and 0 interrupted iterations
mixed_open   [  70% ] 000/050 VUs  2m26.2s/3m30s  60.00 iters/s

running (2m28.0s), 000/050 VUs, 5832 complete and 0 interrupted iterations
mixed_open   [  70% ] 000/050 VUs  2m27.2s/3m30s  60.00 iters/s

running (2m29.0s), 000/050 VUs, 5892 complete and 0 interrupted iterations
mixed_open   [  71% ] 000/050 VUs  2m28.2s/3m30s  60.00 iters/s

running (2m30.0s), 000/050 VUs, 5952 complete and 0 interrupted iterations
mixed_open   [  71% ] 000/050 VUs  2m29.2s/3m30s  60.00 iters/s

running (2m31.0s), 000/050 VUs, 6012 complete and 0 interrupted iterations
mixed_open   [  72% ] 000/050 VUs  2m30.2s/3m30s  60.00 iters/s

running (2m32.0s), 000/050 VUs, 6072 complete and 0 interrupted iterations
mixed_open   [  72% ] 000/050 VUs  2m31.2s/3m30s  60.00 iters/s

running (2m33.0s), 000/050 VUs, 6132 complete and 0 interrupted iterations
mixed_open   [  72% ] 000/050 VUs  2m32.2s/3m30s  60.00 iters/s

running (2m34.0s), 000/050 VUs, 6192 complete and 0 interrupted iterations
mixed_open   [  73% ] 000/050 VUs  2m33.2s/3m30s  60.00 iters/s

running (2m35.0s), 000/050 VUs, 6252 complete and 0 interrupted iterations
mixed_open   [  73% ] 000/050 VUs  2m34.2s/3m30s  60.00 iters/s

running (2m36.0s), 001/050 VUs, 6311 complete and 0 interrupted iterations
mixed_open   [  74% ] 001/050 VUs  2m35.2s/3m30s  60.00 iters/s

running (2m37.0s), 000/050 VUs, 6372 complete and 0 interrupted iterations
mixed_open   [  74% ] 000/050 VUs  2m36.2s/3m30s  60.00 iters/s

running (2m38.0s), 000/050 VUs, 6432 complete and 0 interrupted iterations
mixed_open   [  75% ] 000/050 VUs  2m37.2s/3m30s  60.00 iters/s

running (2m39.0s), 000/050 VUs, 6492 complete and 0 interrupted iterations
mixed_open   [  75% ] 000/050 VUs  2m38.2s/3m30s  60.00 iters/s

running (2m40.0s), 000/050 VUs, 6552 complete and 0 interrupted iterations
mixed_open   [  76% ] 000/050 VUs  2m39.2s/3m30s  60.00 iters/s

running (2m41.0s), 000/050 VUs, 6612 complete and 0 interrupted iterations
mixed_open   [  76% ] 000/050 VUs  2m40.2s/3m30s  60.00 iters/s

running (2m42.0s), 000/050 VUs, 6672 complete and 0 interrupted iterations
mixed_open   [  77% ] 000/050 VUs  2m41.2s/3m30s  60.00 iters/s

running (2m43.0s), 000/050 VUs, 6732 complete and 0 interrupted iterations
mixed_open   [  77% ] 000/050 VUs  2m42.2s/3m30s  60.00 iters/s

running (2m44.0s), 000/050 VUs, 6792 complete and 0 interrupted iterations
mixed_open   [  78% ] 000/050 VUs  2m43.2s/3m30s  60.00 iters/s

running (2m45.0s), 000/050 VUs, 6852 complete and 0 interrupted iterations
mixed_open   [  78% ] 000/050 VUs  2m44.2s/3m30s  60.00 iters/s

running (2m46.0s), 000/050 VUs, 6912 complete and 0 interrupted iterations
mixed_open   [  79% ] 000/050 VUs  2m45.2s/3m30s  60.00 iters/s

running (2m47.0s), 000/050 VUs, 6972 complete and 0 interrupted iterations
mixed_open   [  79% ] 000/050 VUs  2m46.2s/3m30s  60.00 iters/s

running (2m48.0s), 000/050 VUs, 7032 complete and 0 interrupted iterations
mixed_open   [  80% ] 000/050 VUs  2m47.2s/3m30s  60.00 iters/s

running (2m49.0s), 000/050 VUs, 7092 complete and 0 interrupted iterations
mixed_open   [  80% ] 000/050 VUs  2m48.2s/3m30s  60.00 iters/s

running (2m50.0s), 000/050 VUs, 7152 complete and 0 interrupted iterations
mixed_open   [  81% ] 000/050 VUs  2m49.2s/3m30s  60.00 iters/s

running (2m51.0s), 000/050 VUs, 7212 complete and 0 interrupted iterations
mixed_open   [  81% ] 000/050 VUs  2m50.2s/3m30s  60.00 iters/s

running (2m52.0s), 000/050 VUs, 7272 complete and 0 interrupted iterations
mixed_open   [  82% ] 000/050 VUs  2m51.2s/3m30s  60.00 iters/s

running (2m53.0s), 000/050 VUs, 7332 complete and 0 interrupted iterations
mixed_open   [  82% ] 000/050 VUs  2m52.2s/3m30s  60.00 iters/s

running (2m54.0s), 000/050 VUs, 7392 complete and 0 interrupted iterations
mixed_open   [  82% ] 000/050 VUs  2m53.2s/3m30s  60.00 iters/s

running (2m55.0s), 000/050 VUs, 7452 complete and 0 interrupted iterations
mixed_open   [  83% ] 000/050 VUs  2m54.2s/3m30s  60.00 iters/s

running (2m56.0s), 000/050 VUs, 7512 complete and 0 interrupted iterations
mixed_open   [  83% ] 000/050 VUs  2m55.2s/3m30s  60.00 iters/s

running (2m57.0s), 000/050 VUs, 7572 complete and 0 interrupted iterations
mixed_open   [  84% ] 000/050 VUs  2m56.2s/3m30s  60.00 iters/s

running (2m58.0s), 000/050 VUs, 7632 complete and 0 interrupted iterations
mixed_open   [  84% ] 000/050 VUs  2m57.2s/3m30s  60.00 iters/s

running (2m59.0s), 000/050 VUs, 7692 complete and 0 interrupted iterations
mixed_open   [  85% ] 000/050 VUs  2m58.2s/3m30s  60.00 iters/s

running (3m00.0s), 000/050 VUs, 7752 complete and 0 interrupted iterations
mixed_open   [  85% ] 000/050 VUs  2m59.2s/3m30s  60.00 iters/s

running (3m01.0s), 000/050 VUs, 7812 complete and 0 interrupted iterations
mixed_open   [  86% ] 000/050 VUs  3m00.2s/3m30s  60.00 iters/s

running (3m02.0s), 000/050 VUs, 7872 complete and 0 interrupted iterations
mixed_open   [  86% ] 000/050 VUs  3m01.2s/3m30s  60.00 iters/s

running (3m03.0s), 000/050 VUs, 7932 complete and 0 interrupted iterations
mixed_open   [  87% ] 000/050 VUs  3m02.2s/3m30s  60.00 iters/s

running (3m04.0s), 000/050 VUs, 7992 complete and 0 interrupted iterations
mixed_open   [  87% ] 000/050 VUs  3m03.2s/3m30s  60.00 iters/s

running (3m05.0s), 000/050 VUs, 8052 complete and 0 interrupted iterations
mixed_open   [  88% ] 000/050 VUs  3m04.2s/3m30s  60.00 iters/s

running (3m06.0s), 000/050 VUs, 8112 complete and 0 interrupted iterations
mixed_open   [  88% ] 000/050 VUs  3m05.2s/3m30s  60.00 iters/s

running (3m07.0s), 000/050 VUs, 8172 complete and 0 interrupted iterations
mixed_open   [  89% ] 000/050 VUs  3m06.2s/3m30s  60.00 iters/s

running (3m08.0s), 000/050 VUs, 8232 complete and 0 interrupted iterations
mixed_open   [  89% ] 000/050 VUs  3m07.2s/3m30s  60.00 iters/s

running (3m09.0s), 000/050 VUs, 8292 complete and 0 interrupted iterations
mixed_open   [  90% ] 000/050 VUs  3m08.2s/3m30s  60.00 iters/s

running (3m10.0s), 000/050 VUs, 8352 complete and 0 interrupted iterations
mixed_open   [  90% ] 000/050 VUs  3m09.2s/3m30s  60.00 iters/s

running (3m11.0s), 000/050 VUs, 8412 complete and 0 interrupted iterations
mixed_open   [  91% ] 000/050 VUs  3m10.2s/3m30s  60.00 iters/s

running (3m12.0s), 000/050 VUs, 8472 complete and 0 interrupted iterations
mixed_open   [  91% ] 000/050 VUs  3m11.2s/3m30s  60.00 iters/s

running (3m13.0s), 000/050 VUs, 8532 complete and 0 interrupted iterations
mixed_open   [  92% ] 000/050 VUs  3m12.2s/3m30s  60.00 iters/s

running (3m14.0s), 000/050 VUs, 8592 complete and 0 interrupted iterations
mixed_open   [  92% ] 000/050 VUs  3m13.2s/3m30s  60.00 iters/s

running (3m15.0s), 000/050 VUs, 8652 complete and 0 interrupted iterations
mixed_open   [  92% ] 000/050 VUs  3m14.2s/3m30s  60.00 iters/s

running (3m16.0s), 000/050 VUs, 8712 complete and 0 interrupted iterations
mixed_open   [  93% ] 000/050 VUs  3m15.2s/3m30s  60.00 iters/s

running (3m17.0s), 000/050 VUs, 8772 complete and 0 interrupted iterations
mixed_open   [  93% ] 000/050 VUs  3m16.2s/3m30s  60.00 iters/s

running (3m18.0s), 000/050 VUs, 8832 complete and 0 interrupted iterations
mixed_open   [  94% ] 000/050 VUs  3m17.2s/3m30s  60.00 iters/s

running (3m19.0s), 000/050 VUs, 8892 complete and 0 interrupted iterations
mixed_open   [  94% ] 000/050 VUs  3m18.2s/3m30s  60.00 iters/s

running (3m20.0s), 000/050 VUs, 8952 complete and 0 interrupted iterations
mixed_open   [  95% ] 000/050 VUs  3m19.2s/3m30s  60.00 iters/s

running (3m21.0s), 000/050 VUs, 9012 complete and 0 interrupted iterations
mixed_open   [  95% ] 000/050 VUs  3m20.2s/3m30s  60.00 iters/s

running (3m22.0s), 000/050 VUs, 9072 complete and 0 interrupted iterations
mixed_open   [  96% ] 000/050 VUs  3m21.2s/3m30s  60.00 iters/s

running (3m23.0s), 000/050 VUs, 9132 complete and 0 interrupted iterations
mixed_open   [  96% ] 000/050 VUs  3m22.2s/3m30s  60.00 iters/s

running (3m24.0s), 000/050 VUs, 9192 complete and 0 interrupted iterations
mixed_open   [  97% ] 000/050 VUs  3m23.2s/3m30s  60.00 iters/s

running (3m25.0s), 000/050 VUs, 9252 complete and 0 interrupted iterations
mixed_open   [  97% ] 000/050 VUs  3m24.2s/3m30s  60.00 iters/s

running (3m26.0s), 000/050 VUs, 9312 complete and 0 interrupted iterations
mixed_open   [  98% ] 000/050 VUs  3m25.2s/3m30s  60.00 iters/s

running (3m27.0s), 000/050 VUs, 9372 complete and 0 interrupted iterations
mixed_open   [  98% ] 000/050 VUs  3m26.2s/3m30s  60.00 iters/s

running (3m28.0s), 000/050 VUs, 9432 complete and 0 interrupted iterations
mixed_open   [  99% ] 000/050 VUs  3m27.2s/3m30s  60.00 iters/s

running (3m29.0s), 000/050 VUs, 9492 complete and 0 interrupted iterations
mixed_open   [  99% ] 000/050 VUs  3m28.2s/3m30s  60.00 iters/s

running (3m30.0s), 000/050 VUs, 9552 complete and 0 interrupted iterations
mixed_open   [ 100% ] 000/050 VUs  3m29.2s/3m30s  60.00 iters/s


  █ THRESHOLDS 

    http_req_duration{request_class:assessment_write}
    ✓ 'p(95)<400' p(95)=21.37ms

    http_req_duration{request_class:diagnostic}
    ✓ 'p(95)<500' p(95)=4.88ms

    http_req_duration{request_class:mastery_read}
    ✓ 'p(95)<250' p(95)=4.71ms

    http_req_duration{request_class:recommendation_read}
    ✓ 'p(95)<250' p(95)=3.41ms

    http_req_duration{request_class:skill_map_read}
    ✓ 'p(95)<250' p(95)=5.38ms

    http_req_failed
    ✗ 'rate<0.01' rate=17.33%


  █ TOTAL RESULTS 

    checks_total.......: 9599   45.543259/s
    checks_succeeded...: 88.73% 8518 out of 9599
    checks_failed......: 11.26% 1081 out of 9599

    ✓ recommendations read
    ✗ progression read
      ↳  99% — ✓ 3369 / ✗ 2
    ✗ identity read
      ↳  99% — ✓ 494 / ✗ 1
    ✗ attempt created
      ↳  99% — ✓ 950 / ✗ 1
    ✓ mastery read
    ✗ submit COMPLETED
      ↳  23% — ✓ 322 / ✗ 1077
    ✓ curriculum read

    HTTP
    http_req_duration.........................: avg=2.85ms min=172.51µs med=2.17ms max=317.87ms p(90)=3.8ms   p(95)=6.23ms 
      { expected_response:true }..............: avg=3.4ms  min=658.55µs med=2.43ms max=317.87ms p(90)=4.15ms  p(95)=7.21ms 
      { request_class:assessment_write }......: avg=4.14ms min=172.51µs med=1.78ms max=317.87ms p(90)=18.37ms p(95)=21.37ms
      { request_class:diagnostic }............: avg=2.54ms min=351.81µs med=1.98ms max=37.56ms  p(90)=3.95ms  p(95)=4.88ms 
      { request_class:mastery_read }..........: avg=3.04ms min=2.11ms   med=2.67ms max=49.93ms  p(90)=3.65ms  p(95)=4.71ms 
      { request_class:recommendation_read }...: avg=2.08ms min=1.29ms   med=1.76ms max=75.83ms  p(90)=2.59ms  p(95)=3.41ms 
      { request_class:skill_map_read }........: avg=3.19ms min=320.94µs med=2.82ms max=49.12ms  p(90)=3.91ms  p(95)=5.38ms 
    http_req_failed...........................: 17.33% 2153 out of 12417
    http_reqs.................................: 12417  58.913496/s

    EXECUTION
    iteration_duration........................: avg=3.77ms min=401.6µs  med=2.64ms max=364.26ms p(90)=4.06ms  p(95)=7.12ms 
    iterations................................: 9599   45.543259/s
    vus.......................................: 0      min=0             max=1 
    vus_max...................................: 50     min=50            max=50

    NETWORK
    data_received.............................: 37 MB  173 kB/s
    data_sent.................................: 19 MB  88 kB/s



running (3m30.8s), 000/050 VUs, 9599 complete and 0 interrupted iterations
mixed_open ✗ [ 100% ] 000/050 VUs  3m30.0s/3m30s  60.00 iters/s
time="2026-08-21T09:50:57Z" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"
Restored directAccessGrantsEnabled=False on ramals-web-ui; removed 20 load learner(s).